GENDER_CHOICES = [("ذكر", "ذكر"), ("أنثى", "أنثى")] 

GOVERNORATE_CHOICES = [
    ('Alexandria', 'الإسكندرية'),
    ('Aswan', 'أسوان'),
    ('Asyut', 'أسيوط'),
    ('Beheira', 'البحيرة'),
    ('Beni Suef', 'بني سويف'),
    ('Cairo', 'القاهرة'),
    ('Dakahlia', 'الدقهلية'),
    ('Damietta', 'دمياط'),
    ('Faiyum', 'الفيوم'),
    ('Gharbia', 'الغربية'),
    ('Giza', 'الجيزة'),
    ('Ismailia', 'الإسماعيلية'),
    ('Kafr El Sheikh', 'كفر الشيخ'),
    ('Luxor', 'الأقصر'),
    ('Matrouh', 'مطروح'),
    ('Minya', 'المنيا'),
    ('Monufia', 'المنوفية'),
    ('New Valley', 'الوادي الجديد'),
    ('North Sinai', 'شمال سيناء'),
    ('Port Said', 'بورسعيد'),
    ('Qalyubia', 'القليوبية'),
    ('Qena', 'قنا'),
    ('Red Sea', 'البحر الأحمر'),
    ('Sharqia', 'الشرقية'),
    ('Sohag', 'سوهاج'),
    ('South Sinai', 'جنوب سيناء'),
    ('Suez', 'السويس'),
]


PERIOD_CHOICES = (
        ('10-11', '10 AM - 11 AM'),
        ('11-12', '11 AM - 12 PM'),
        ('12-1', '12 PM - 1 PM'),
        
        ('4-5', '4 PM - 5 PM'),
        ('5-6', '5 PM - 6 PM'),
        ('6-7', '6 PM - 7 PM'),
    )

SHIFT_PERIOD_CHOICES = (
        ('دوام صباحي', 'دوام صباحي'),
        ('دوام مسائي', 'دوام مسائي'),
    )

DOCTOR_SPECIALIZE_CHOICES = (
        ('طبيب استشاري', 'طبيب استشاري'),
        ('طبيب أخصائي', 'طبيب أخصائي'),
        ('طبيب ممارس', 'طبيب ممارس'),
    )